## Plan Result (Aks_ptlsbox)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Create
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;spotinstance&#34;]
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
* Delete
  * module.kubernetes[&#34;00&#34;].azurerm_role_assignment.uami_rg_identity_operator[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
        id                                  = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks"
      ~ kubernetes_version                  = "1.28.3" -> "1.27"
        name                                = "cft-ptlsbox-00-aks"
      ~ tags                                = {
            "application"  = "core"
          + "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
          + "criticality"  = "Low"
            "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          - "startupMode"  = "onDemand" -> null
        }
        # (29 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "system"
          ~ orchestrator_version         = "1.28.3" -> "1.27"
            tags                         = {
                "application"  = "core"
                "autoShutdown" = "true"
                "builtFrom"    = "hmcts/aks-cft-deploy"
                "businessArea" = "CFT"
                "criticality"  = "Low"
                "environment"  = "sandbox"
                "expiresAfter" = "3000-01-01"
            }
            # (22 unchanged attributes hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/cronjob"
        name                    = "cronjob"
      ~ orchestrator_version    = "1.28.3" -> "1.27"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
        id                      = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks/agentPools/linux"
        name                    = "linux"
      ~ orchestrator_version    = "1.28.3" -> "1.27"
        tags                    = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-cft-deploy"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["spotinstance"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + enable_auto_scaling   = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-00-rg/providers/Microsoft.ContainerService/managedClusters/cft-ptlsbox-00-aks"
      + max_count             = 5
      + max_pods              = 30
      + min_count             = 0
      + mode                  = "User"
      + name                  = "spotinstance"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + node_taints           = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version  = "1.27"
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Ephemeral"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Spot"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_D4ds_v5"
      + vnet_subnet_id        = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/cft-ptlsbox-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptlsbox-vnet/subnets/aks-00"

      + timeouts {
          + update = "180m"
        }
    }

  # module.kubernetes["00"].azurerm_role_assignment.uami_rg_identity_operator[0] will be destroyed
  # (because azurerm_role_assignment.uami_rg_identity_operator is not in configuration)
  - resource "azurerm_role_assignment" "uami_rg_identity_operator" {
      - id                   = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/managed-identities-ptlsbox-rg/providers/Microsoft.Authorization/roleAssignments/e28d7846-85ea-df6d-74bf-204cbc6dd779" -> null
      - name                 = "e28d7846-85ea-df6d-74bf-204cbc6dd779" -> null
      - principal_id         = "15b684dc-026f-4370-8cf4-c27d0af1033f" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/providers/Microsoft.Authorization/roleDefinitions/f1a07417-d97a-45cb-824c-7a7467783830" -> null
      - role_definition_name = "Managed Identity Operator" -> null
      - scope                = "/subscriptions/1497c3d7-ab6d-4bb7-8a10-b51d03189ee3/resourceGroups/managed-identities-ptlsbox-rg" -> null
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":613,"Program":"tfcmt","SHA1":"","Target":"Aks_ptlsbox","Vars":{}} -->